cask_args appdir: '/Applications'

brew 'git'
brew 'hub'
brew 'git-secrets'
brew 'libgit2'

brew 'node'
brew 'redis'

brew 'docker'
brew 'docker-compose'
brew 'docker-machine'

cask 'minikube'
brew 'kubernetes-cli'

cask 'google-cloud-sdk'
brew 'awscli'
brew 'azure-cli'

brew 'yarn', args: ["ignore-dependencies"]

tap 'homebrew/services'

brew 'postgresql'
brew 'mysql'
brew 'mailhog'