cask_args appdir: '/Applications'

cask 'the-unarchiver'
cask 'google-chrome'
cask 'firefox'
cask 'slack'
cask 'evernote'
cask 'skype'
cask 'lastpass'
cask 'dropbox'

brew 'git'
brew 'libgit2'

brew 'yarn', args: ["ignore-dependencies"]
brew 'the_silver_searcher'

tap 'homebrew/services'

brew 'postgresql'
brew 'mysql'

brew 'hub'

brew 'mailhog'

cask 'github-desktop'
cask 'sublime-text'
cask 'sequel-pro'
cask 'virtualbox'
cask 'vagrant'
cask 'iterm2'
cask 'insomnia'

tap 'homebrew/homebrew-php'
brew 'php71'
brew 'composer'
